SeeedWenzy/MeshPager_X2_PCBA/examples/test_wireless_coexistence/sdkconfig.defaults
# ESP32-S3 wireless coexistence test
CONFIG_IDF_TARGET="esp32s3"
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_SPEED_80M=y
CONFIG_SPIRAM_MALLOC_ALWAYSINTERNAL=1024
CONFIG_SPIRAM_MALLOC_RESERVE_INTERNAL=262144
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_240=y
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ=240

CONFIG_ESP_CONSOLE_USB_SERIAL_JTAG=y
CONFIG_ESP_CONSOLE_SECONDARY_NONE=y

CONFIG_BT_ENABLED=y
CONFIG_BTDM_CTRL_MODE_BLE_ONLY=y
CONFIG_BTDM_CTRL_MODE_BR_EDR_ONLY=n
CONFIG_BTDM_CTRL_MODE_BTDM=n
CONFIG_BT_BLUEDROID_ENABLED=n
CONFIG_BT_NIMBLE_ENABLED=y

CONFIG_ESPTOOLPY_FLASHMODE_QIO=y
CONFIG_ESPTOOLPY_FLASHFREQ_80M=y

CONFIG_ESP_WIFI_STATIC_RX_BUFFER_NUM=16
CONFIG_ESP_WIFI_DYNAMIC_RX_BUFFER_NUM=64
CONFIG_ESP_WIFI_DYNAMIC_TX_BUFFER_NUM=64
CONFIG_ESP_WIFI_AMPDU_TX_ENABLED=y
CONFIG_ESP_WIFI_TX_BA_WIN=32
CONFIG_ESP_WIFI_AMPDU_RX_ENABLED=y
CONFIG_ESP_WIFI_RX_BA_WIN=32

CONFIG_LWIP_TCP_SND_BUF_DEFAULT=65535
CONFIG_LWIP_TCP_WND_DEFAULT=65535
CONFIG_LWIP_UDP_RECVMBOX_SIZE=64
CONFIG_LWIP_TCPIP_RECVMBOX_SIZE=64
CONFIG_IPERF_SOCKET_RX_TIMEOUT=10
CONFIG_IPERF_SOCKET_TCP_TX_TIMEOUT=10
CONFIG_IPERF_TRAFFIC_TASK_PRIORITY=4
CONFIG_IPERF_REPORT_TASK_PRIORITY=6
CONFIG_IPERF_DEF_TCP_TX_BUFFER_LEN=16384
CONFIG_IPERF_DEF_TCP_RX_BUFFER_LEN=16384
CONFIG_IPERF_DEF_IPV4_UDP_TX_BUFFER_LEN=1470
CONFIG_IPERF_DEF_IPV6_UDP_TX_BUFFER_LEN=1450
CONFIG_IPERF_DEF_UDP_RX_BUFFER_LEN=16384

CONFIG_RADIO_SPI_HOST=1
CONFIG_RADIO_CS_GPIO=6
CONFIG_RADIO_SCK_GPIO=3
CONFIG_RADIO_MOSI_GPIO=4
CONFIG_RADIO_MISO_GPIO=5
CONFIG_RADIO_BUSY_GPIO=8
CONFIG_RADIO_INT_GPIO=7
CONFIG_RADIO_RST_GPIO=10
